'''
1. Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
Пример:
- 6 -> да
- 7 -> да
- 1 -> нет
'''
def DayOff():
    day=input('Введите число: ')
    if (not day.isdigit() or int(day)<=0 or int(day)>7):
        print('\nОшибка ввода! Введите число от 1 до 7!\n')
        return DayOff()  
    elif (int(day)==6 or int(day)==7):
        return 'Выходной день!'
    else:
        return 'Чёртовы будни :-('
print(DayOff())